# StudentGradePrediction

## In this notebook we will explore the supervised classification machine learning algorithmn

The goal is to clearly understand how classification work and to explore furthur into that catagory.

In [3]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Score': [75, 20, 45],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

In [2]:
df

      Name  Score         City
0    Alice     75     New York
1      Bob     20  Los Angeles
2  Charlie     45      Chicago

In [ ]:
df